STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_HeartRateFreeRTOS/STM32_WPAN/App/app_ble.c
/* Host stack buffers */
static osMemoryPoolId_t host_pool;
static osMemoryPoolId_t gatt_pool;
static osMemoryPoolId_t host_event_pool;
static osMemoryPoolId_t host_nvm_pool;
static osMemoryPoolId_t long_write_pool;
static osMemoryPoolId_t extra_data_pool;
static uint32_t *host_buffer;
static uint32_t *gatt_buffer;
static uint16_t *host_event_buffer;
static uint64_t *host_nvm_buffer;
static uint8_t *long_write_buffer;
static uint8_t *extra_data_buffer;

static osThreadId_t     BleHostTaskHandle;

const osThreadAttr_t BleHostTask_attributes = {
  .name         = "BLE Host Task",
  .priority     = TASK_PRIO_BLE_HOST,
  .stack_size   = TASK_STACK_SIZE_BLE_HOST,
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE,
  .stack_mem    = TASK_DEFAULT_STACK_MEM
};

osThreadId_t            HciAsyncEvtTaskHandle;
osSemaphoreId_t         HciAsyncEvtSemaphore;

const osThreadAttr_t HciAsyncEvtTask_attributes = {
  .name         = "HCI async Event Task",
  .priority     = TASK_PRIO_HCI_ASYNC_EVENT,
  .stack_size   = TASK_STACK_SIZE_HCI_ASYNC_EVENT,
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE,
  .stack_mem    = TASK_DEFAULT_STACK_MEM
};

const osSemaphoreAttr_t HciAsyncEvtSemaphore_attributes = {
  .name         = "HCI async Event Semaphore",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE
};

/* USER CODE BEGIN PV */
uint8_t a_GATT_DevInfoData[22];

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
osSemaphoreId_t       BleHostSemaphore;
osSemaphoreId_t       GapProcCompleteSemaphore;

const osSemaphoreAttr_t BleHostSemaphore_attributes = {
  .name         = "BLE Host Semaphore",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE
};

const osSemaphoreAttr_t GapProcCompleteSemaphore_attributes = {
  .name         = "GAP procedure complete Semaphore",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE
};

/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static uint8_t HOST_BLE_Init(void);
static void BLE_ResumeFlowProcessCallback(void);
static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGenerateBdAddress(void);
static const uint8_t* BleGenerateIRValue(void);
static const uint8_t* BleGenerateERValue(void);
static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);
static void BLE_HOST_Task_Entry(void* argument);
static void HciAsyncEvt_Task_Entry(void* argument);
/* USER CODE BEGIN PFP */
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t *p_bd_addr);

/* USER CODE END PFP */

/* External functions prototypes ---------------------------------------------*/

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  /* USER CODE BEGIN APP_BLE_Init_1 */

  /* USER CODE END APP_BLE_Init_1 */

  LST_init_head(&BleAsynchEventQueue);

  /* Create memory pools for BLE */
  host_pool = osMemoryPoolNew(1, BLE_DYN_ALLOC_SIZE, NULL);
  gatt_pool = osMemoryPoolNew(1, BLE_GATT_BUF_SIZE, NULL);
  host_event_pool = osMemoryPoolNew(1, BLE_HOST_EVENT_BUF_SIZE, NULL);
  host_nvm_pool = osMemoryPoolNew(1, CFG_BLE_NVM_SIZE_MAX*8, NULL);
  long_write_pool = osMemoryPoolNew(1, CFG_BLE_LONG_WRITE_DATA_BUF_SIZE, NULL);
  extra_data_pool = osMemoryPoolNew(1, CFG_BLE_EXTRA_DATA_BUF_SIZE, NULL);

  /* Allocate buffers for BLE */
  host_buffer = osMemoryPoolAlloc(host_pool, osWaitForever);
  gatt_buffer = osMemoryPoolAlloc(gatt_pool, osWaitForever);
  host_event_buffer = osMemoryPoolAlloc(host_event_pool, osWaitForever);
  host_nvm_buffer  = osMemoryPoolAlloc(host_nvm_pool, osWaitForever);
  long_write_buffer = osMemoryPoolAlloc(long_write_pool, osWaitForever);
  extra_data_buffer = osMemoryPoolAlloc(extra_data_pool, osWaitForever);

  /* Check allocation */
  if (((host_buffer == NULL) && (BLE_DYN_ALLOC_SIZE != 0))
      || ((gatt_buffer == NULL) && (BLE_GATT_BUF_SIZE != 0))
      || ((host_event_buffer == NULL) && (BLE_HOST_EVENT_BUF_SIZE != 0))
      || ((host_nvm_buffer == NULL) && (CFG_BLE_NVM_SIZE_MAX != 0))
      || ((long_write_buffer == NULL) && (CFG_BLE_LONG_WRITE_DATA_BUF_SIZE != 0))
      || ((extra_data_buffer == NULL) && (CFG_BLE_EXTRA_DATA_BUF_SIZE != 0)))
  {
    /* Buffer allocation failed, check FreeRTOS Heap size */
    Error_Handler();
  }

  /* Create BLE Host FreeRTOS objects */

  BleHostTaskHandle = osThreadNew(BLE_HOST_Task_Entry, NULL, &BleHostTask_attributes);

  BleHostSemaphore = osSemaphoreNew(1U, 0U, &BleHostSemaphore_attributes);

  if((BleHostTaskHandle == NULL) || (BleHostSemaphore == NULL) )
  {
    LOG_ERROR_APP( "BLE Host FreeRTOS objects creation FAILED");
    Error_Handler();
  }

  HciAsyncEvtTaskHandle = osThreadNew(HciAsyncEvt_Task_Entry, NULL, &HciAsyncEvtTask_attributes);

  HciAsyncEvtSemaphore = osSemaphoreNew(1U, 0U, &HciAsyncEvtSemaphore_attributes);

  if((HciAsyncEvtTaskHandle == NULL) || (HciAsyncEvtSemaphore == NULL) )
  {
    LOG_ERROR_APP( "HCI Async Event FreeRTOS objects creation FAILED");
    Error_Handler();
  }

  /* Initialise NVM RAM buffer, invalidate it's content before restoration */
  host_nvm_buffer[0] = 0;

  /* Register A NVM buffer for BLE Host stack */
  SNVMA_Register(APP_BLE_NvmBuffer,
                  (uint32_t *)host_nvm_buffer,
                  (CFG_BLE_NVM_SIZE_MAX * 2));

  /* Realize a restore */
  SNVMA_Restore(APP_BLE_NvmBuffer);
  /* USER CODE BEGIN APP_BLE_Init_Buffers */

