STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_HeartRateFreeRTOS/STM32_WPAN/App/app_ble.c
  /* USER CODE END APP_BLE_Init_Buffers */

  /* Initialize BLE related modules */
  BAES_Reset( );
  PKACTRL_Reset();
  BLE_TIMER_Init();

  /* Initialize the BLE Host */
  if (HOST_BLE_Init() == 0u)
  {
    /* Initialization of HCI & GATT & GAP layer */
    Ble_Hci_Gap_Gatt_Init();

    GapProcCompleteSemaphore = osSemaphoreNew(1U, 0U, &GapProcCompleteSemaphore_attributes);
    if (GapProcCompleteSemaphore == NULL)
    {
      Error_Handler();
    }

    /* Initialization of the BLE Services */
    SVCCTL_Init();

    /* Initialization of the BLE App Context */
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    bleAppContext.connectionHandle = 0xFFFF;

    /* From here, all initialization are BLE application specific */

    /* USER CODE BEGIN APP_BLE_Init_4 */

    /* USER CODE END APP_BLE_Init_4 */

    /* Initialize Services and Characteristics. */
    LOG_INFO_APP("\n");
    LOG_INFO_APP("Services and Characteristics creation\n");
    HRS_APP_Init();
    DIS_APP_Init();
    LOG_INFO_APP("End of Services and Characteristics creation\n");
    LOG_INFO_APP("\n");

    /* USER CODE BEGIN APP_BLE_Init_3 */

    uint16_t adv_cmd = 0;
    osMessageQueuePut(advertisingCmdQueueHandle, &adv_cmd, 0U, 0U);

    /* USER CODE END APP_BLE_Init_3 */

  }
  /* USER CODE BEGIN APP_BLE_Init_2 */
  bleAppContext.connIntervalFlag = 0;

  /* USER CODE END APP_BLE_Init_2 */

  return;
}

/* All BLE activities must be stopped before calling this API */
void APP_BLE_Deinit(void)
{
  /* USER CODE BEGIN APP_BLE_Deinit_1 */

  /* USER CODE END APP_BLE_Deinit_1 */

  aci_reset(0, 0);

  /* Free memory buffers */
  osMemoryPoolFree(host_buffer, host_pool);
  osMemoryPoolFree(host_buffer, gatt_pool);
  osMemoryPoolFree(host_buffer, host_event_pool);
  osMemoryPoolFree(host_buffer, host_nvm_pool);
  osMemoryPoolFree(host_buffer, long_write_pool);
  osMemoryPoolFree(host_buffer, extra_data_pool);

  /* Delete Memory Pools */
  osMemoryPoolDelete(host_pool);
  osMemoryPoolDelete(gatt_pool);
  osMemoryPoolDelete(host_event_pool);
  osMemoryPoolDelete(host_nvm_pool);
  osMemoryPoolDelete(long_write_pool);
  osMemoryPoolDelete(extra_data_pool);

  /* De-initialize BLE related modules */
  BAES_Reset( );
  PKACTRL_Reset();
  BLE_TIMER_Deinit();

  tListNode *listNodeRemoved;

  /* Free all the Asynchronous Event queue nodes */
  while(LST_is_empty(&BleAsynchEventQueue) != TRUE)
  {
    LST_remove_tail(&BleAsynchEventQueue, &listNodeRemoved);
    (void)AMM_Free((uint32_t *)listNodeRemoved);
  }

  /* Delete BLE Host stack FreeRTOS objects */
  /* Only delete semaphore if it was successfully created */
  if (BleHostSemaphore != NULL)
  {
    LOG_INFO_APP("Deleting semaphore %s, status : ", BleHostSemaphore_attributes.name);
    if (osSemaphoreDelete(BleHostSemaphore) != osOK)
    {
      LOG_INFO_APP("FAILED\n");
      Error_Handler();
    }
    else
    {
      LOG_INFO_APP("SUCCESS\n");
      BleHostSemaphore = NULL;
    }
  }

  if (HciAsyncEvtSemaphore != NULL)
  {
    LOG_INFO_APP("Deleting semaphore %s, status : ", HciAsyncEvtSemaphore_attributes.name);
    if (osSemaphoreDelete(HciAsyncEvtSemaphore) != osOK)
    {
      LOG_INFO_APP("FAILED\n");
      Error_Handler();
    }
    else
    {
      LOG_INFO_APP("SUCCESS\n");
      HciAsyncEvtSemaphore = NULL;
    }
  }

  if (GapProcCompleteSemaphore != NULL)
  {
    LOG_INFO_APP("Deleting semaphore %s, status : ", GapProcCompleteSemaphore_attributes.name);
    if (osSemaphoreDelete(GapProcCompleteSemaphore) != osOK)
    {
      LOG_INFO_APP("FAILED\n");
      Error_Handler();
    }
    else
    {
      LOG_INFO_APP("SUCCESS\n");
      GapProcCompleteSemaphore = NULL;
    }
  }

  /* Terminate then delete the thread only if created */
  if (BleHostTaskHandle != NULL)
  {
    LOG_INFO_APP("Terminating and Deleting thread %s, status : ", BleHostTask_attributes.name);
    if (osThreadTerminate(BleHostTaskHandle) != osOK)
    {
      LOG_INFO_APP("FAILED\n");
      Error_Handler();
    }
    else
    {
      LOG_INFO_APP("SUCCESS\n");
      BleHostTaskHandle = NULL;
    }

  }

  if (HciAsyncEvtTaskHandle != NULL)
  {
    LOG_INFO_APP("Terminating and Deleting thread %s, status : ", HciAsyncEvtTask_attributes.name);
    if (osThreadTerminate(HciAsyncEvtTaskHandle) != osOK)
    {
      LOG_INFO_APP("FAILED\n");
      Error_Handler();
    }
    else
    {
      LOG_INFO_APP("SUCCESS\n");
      HciAsyncEvtTaskHandle = NULL;
    }
  }

  /* USER CODE BEGIN APP_BLE_Deinit_2 */

  /* USER CODE END APP_BLE_Deinit_2 */
  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  tBleStatus ret = BLE_STATUS_ERROR;
  hci_event_pckt    *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;
  UNUSED(ret);
  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  switch (p_event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 *p_disconnection_complete_event;
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;
      if (p_disconnection_complete_event->Connection_Handle == bleAppContext.connectionHandle)
      {
        bleAppContext.connectionHandle = 0xFFFF;
        bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
        LOG_INFO_APP(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE\n");
        LOG_INFO_APP("     - Connection Handle:   0x%04X\n     - Reason:    0x%02X\n",
                    p_disconnection_complete_event->Connection_Handle,
                    p_disconnection_complete_event->Reason);

        /* USER CODE BEGIN EVT_DISCONN_COMPLETE_2 */

        /* USER CODE END EVT_DISCONN_COMPLETE_2 */
      }
      gap_cmd_resp_release();

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */

      /* USER CODE END EVT_DISCONN_COMPLETE_1 */
      HRSHandleNotification.EvtOpcode = HRS_DISCON_HANDLE_EVT;
      DISHandleNotification.EvtOpcode = DIS_DISCON_HANDLE_EVT;
      HRSHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      DISHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      HRS_APP_EvtRx(&HRSHandleNotification);
      DIS_APP_EvtRx(&DISHandleNotification);
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */
      uint16_t adv_cmd = 0;
      osMessageQueuePut(advertisingCmdQueueHandle, &adv_cmd, 0U, 0U);

      /* USER CODE END EVT_DISCONN_COMPLETE */
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */
    }
    case HCI_HARDWARE_ERROR_EVT_CODE:
    {
       hci_hardware_error_event_rp0 *p_hardware_error_event;

       p_hardware_error_event = (hci_hardware_error_event_rp0 *)p_event_pckt->data;
       UNUSED(p_hardware_error_event);
       LOG_INFO_APP(">>== HCI_HARDWARE_ERROR_EVT_CODE\n");
       LOG_INFO_APP("Hardware Code = 0x%02X\n",p_hardware_error_event->Hardware_Code);
       /* USER CODE BEGIN HCI_EVT_LE_HARDWARE_ERROR */

       /* USER CODE END HCI_EVT_LE_HARDWARE_ERROR */
       break; /* HCI_HARDWARE_ERROR_EVT_CODE */
    }
    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          uint32_t conn_interval_us = 0;
          hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
          p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          conn_interval_us = p_conn_update_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n     - Status:                0x%02X\n",
                       conn_interval_us / 1000,
                       (conn_interval_us%1000) / 10,
                       p_conn_update_complete->Conn_Latency,
                       p_conn_update_complete->Supervision_Timeout*10,
                       p_conn_update_complete->Status);
          UNUSED(conn_interval_us);
          UNUSED(p_conn_update_complete);

